cf/Documents/Письмо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Письмо</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрДокументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофильИнтернетПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СвязанныеДокументы</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
								<v8:Type>cfg:DocumentRef.АктСверкиВзаиморасчетов</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомуСписок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кому</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КопияСписок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кому</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Catalogs/ХранилищеДвоичныхДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ХранилищеДвоичныхДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранилищеБинарныхДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonForms/ФормаПрезентации/Ext/Form/Module.bsl
&НаКлиенте
перем ПутьКПрограмме;
&НаКлиенте
перем ИмяПрограммы;
&НаКлиенте
перем КомандаПрограммы;
&НаКлиенте
перем ВременныйКаталог;
&НаКлиенте
перем СформированныйПДФФайл;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекстХТМЛ = Параметры.ТекстХТМЛ;
	Если ТипЗнч(Параметры.ДополнительныеПараметры) = Тип("Массив") Тогда
		Для Каждого Элемент Из Параметры.ДополнительныеПараметры Цикл 
			ЗаполнитьЗначенияСвойств(ДополнительныеПараметры.Добавить(), Элемент) 
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПДФ(Команда)
	СформированныйПДФФайл = "";
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(Режим);
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;
	ДиалогВыбораКаталога.Заголовок = "Укажите имя файла";
	//ДиалогВыбораКаталога.Расширение = "pdf";
	ДиалогВыбораКаталога.Фильтр = "*.pdf";
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		СформированныйПДФФайл = КонвертироватьHTMLвPDF(ДиалогВыбораКаталога.Каталог, ДиалогВыбораКаталога.ПолноеИмяФайла);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция КонвертироватьHTMLвPDF(Каталог, ПолноеИмяФайла)
	ЭтоВременныйКаталог = Ложь;	
	//ИмяФайлаПДФ = "Present"+"_"+Строка(УникальныйИдентификатор)+".pdf";
	Файл_ = Новый Файл(ПолноеИмяФайла);
	ИмяФайлаПДФ = Файл_.Имя;
	//ВременныйКаталог = КаталогВременныхФайлов();
	ВременныйФайлХТМЛ = ""; //полное имя временного файла
	/////Создадим html файл///////////////////////////////////////////
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.УстановитьТекст(ТекстХТМЛ);
	
	Попытка
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("html");
		ТекстДок.Записать(ИмяВременногоФайла, КодировкаТекста.UTF8);
		//ВременныйФайлХТМЛ = ВременныйКаталог+"\"+ИмяФайлаПДФ;
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	/////теперь конвертируем его в pdf  с помощью внешней программы//////
	//Программа хранится на сетевом диске и в реквизите справочника с типом ХранилищеЗначений
	//Если ее вдруг не окажется на сетевом диске, или диск будет не доступен то распакуем ее из Хранилища значений
	Файл = Новый Файл(ПутьКПрограмме+ИмяПрограммы);
	Если НЕ Файл.Существует() Тогда                                         
		Адрес = ПолучитьАдресПрограммыИзХранилищаЗначений(ИмяПрограммы);    
		ФайлПрограммы = ПолучитьИзВременногоХранилища(Адрес);               
		ФайлПрограммы.Записать(КаталогВременныхФайлов()+"\"+ИмяПрограммы);  
		ПутьКПрограмме = КаталогВременныхФайлов();                          
		ЭтоВременныйКаталог = Истина;                                       
	КонецЕсли;
	
	ВременныйФайлХТМЛ_ = "file:///"+СтрЗаменить(ИмяВременногоФайла,"\", "/");
	КомандаСистемы(ПутьКПрограмме+КомандаПрограммы+" "+ВременныйФайлХТМЛ_+" "+ПолноеИмяФайла);
	////убираем а собой мусор
	Попытка
		Если ЭтоВременныйКаталог Тогда
			УдалитьФайлы(ПутьКПрограмме+ИмяПрограммы);
		КонецЕсли;
		УдалитьФайлы(ИмяВременногоФайла);	
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	Возврат ПолноеИмяФайла;
КонецФункции

&НаСервере
Функция ПолучитьАдресПрограммыИзХранилищаЗначений(ИмяПрограммы)
	Спр = Справочники.ХранилищеДвоичныхДанных.НайтиПоНаименованию(ИмяПрограммы);
	Темп = Спр.ХранилищеБинарныхДанных.Получить();
	Адрес = ПоместитьВоВременноеХранилище(Темп, УникальныйИдентификатор);
	Возврат Адрес;
КонецФункции

&НаКлиенте
Процедура ОтправитьНаЭлектроннуюПочту(Команда)
	Если СформированныйПДФФайл = "" Тогда
		СформированныйПДФФайл = КонвертироватьHTMLвPDF(КаталогВременныхФайлов(), ПолучитьИмяВременногоФайла("pdf"));		
	КонецЕсли;
	Кому = Новый Массив;
		Для Каждого Строка Из ДополнительныеПараметры Цикл 		
			Структура = Новый Структура("Партнер", Строка.Партнер);
			Если Найти(Строка.Почта, "@") Тогда 
				Структура.Вставить("Почта", Строка.Почта); 
			КонецЕсли; 
			
			Кому.Добавить(Структура); 
		КонецЦикла;
		//	
		//	// Добавим вложения
		//
		Файл = новый Файл(СформированныйПДФФайл);	
		Вложения = Новый Массив;
		Вложения.Добавить(Новый Структура("ИмяФайла, ПолноеИмяФайла", Файл.Имя, СформированныйПДФФайл));
		
		// Откроем письмо для отправки
		
		ОткрытьФорму("Документ.Письмо.Форма.Письмо2",Новый Структура("Кому, Вложения, УдалитьФайлыПослеОтправки", Кому, Вложения), ЭтаФорма,,,,Новый ОписаниеОповещения("ПослеОтправкиПисьма", ЭтаФорма, Новый Структура)); 			
КонецПроцедуры



&НаСервере
Процедура ПослеОтправкиПисьма(Результат, Параметры) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПутьКПрограмме = "Z:\temp\wkhtmltopdf\bin\";
	ВременныйКаталог = "Z:\temp\";
	ИмяПрограммы = "wkhtmltopdf.exe";
	КомандаПрограммы = "wkhtmltopdf";
	СформированныйПДФФайл = "";
КонецПроцедуры
